<?php

namespace Database\Seeders;

use App\Models\Competence;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CompetenceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $items = [
            ["الاتزان الانفعالي والثقة بالنفس.",0],
            ["المرونة وحسن التصرف.",0],
            ["الحماس وتحمل المسئولية.",0],
            ["سلامة النطق ووضوحه.",0],
            ["علاقة المعلمة بالأطفال.",0],
            ["التخطيط المسبق للبيئة الصفية والنشاط التعليمي.",0],
            ["تيقن الهدف العام بطريقة منطقية ومترابطة.",0],
            ["مدى مناسبة الأهداف في مجالات النمو الثلاثة.",0],
            ["تنظيم محتوى الخبرة بطريقة منطقية ومترابطة.",0],
            ["إعداد وتنظيم سجل التحضير.",0],
            ["تستخدم منبها مناسبا لبدء النشاط.",0],
            ["تعد المواقف بطريقة تستثير تساؤلات الأطفال.",0],
            ["تحرص على التسلسل المنطقي في عرض المفاهيم والمعلومات.",0],
            ["تحرص على التنويع في اساليب العرض.",0],
            ["تستخدم وسائل وتقنيات مناسبة.",0],
            ["تحاور وتناقش الأطفال بشكل فعال.",0],
            ["قادرة على إدارة وضبط الفصل.",0],
            ["تستخدم طرق تدريس وأساليب مناسبة لنمو الطفل.",0],
            ["تعزز السلوكيات الإيجابية لدى الأطفال.",0],
            ["تكسب الأطفال المفاهيم والمهارات المختلفة (عقلية معرفية - اجتماعية وجدانية - حسية حركية).",0],
            ["تستثمر الوقت المخصص للنشاط.",0],
            ["تعزز وتنمي التفوق لدى الاأطفال.",0],
            ["تراعي الفروق الفردية.",0],
            ["تراعي الأطفال ذوي المشكلات.",0],
            ["تعد الأركان بصورة مناسبة.",0],
            ["قادرة على ربط الحلقة بالأركان.",0],
            ["تتبع أدوار مناسبة حسب الموقف التعليمي.",0],
            ["تحدد مستوى تطبيق المهارة.",0],
            ["تحدد نوع التفاعل الاجتماعي.",0],
            ["ملمه بمهارات الأركان التعليمية.",0],
            ["تتيح الفرصة للأطفال للاعتماد على أنفسهم.",0],
            ["تساعد الأطفال على تحقيق التعلم الذاتي.",0],
            ["تشجع الأطفال على الإبداع والابتكار.",0],
            ["تهتم بممارسات أساليب التقويم الشامل والمستمر.",0],
            ["تهتم باستخدام أدوات تقويم الطفل.",0],
            ["سجلات المهارات والممارسات الأطفال.",0],
            ["كراسات التطبيقات.",0],
            ["إنتاج الطفل.",0],
            ["الإعداد المسبق لنشاط المكتبة.",0],
            ["توجيه الأطفال لسلوكيات تربوية خاصة بالمكتبة.",0],
            ["توزيع الأطفال لفترة المطالعة وتفعيل ركن الاستماع.",0],
            ["مراعاة التنويع وحرية اختيار الطفل للقصة حسب رغبته.",0],
            ["توجيه الأطفال لكيفية تصفح القصة وأسلوب المطالعة.",0],
            ["مناقشة الأطفال خلال فترة المطالعة والتبادل فيما بينهم.",0],
            ["مدى مناسبة القصة أو الفيلم التعليمي التربوي للفئة العمرية.",0],
            ["مراعاة أسلوب التشويق عند سرد القصة أو الفيلم التعليمي.",0],
            ["مناقشة المعلمة لأطفالها حول أحداث القصة أو الفيلم التعليمي التربوي.",0],
            ["مناسبة التقنيات التربوية.",0],
            ["الاهتمام بتشجيع الطفل على سرد القصة المستعارة.",0],
            ["الاهتمام بتشجيع الطفل على استعارة القصص.",0],
            ["تطور أداؤها في ضوء الملاحظات والتوجيهات.",0],
            ["قامت بتنشيط ومشاركة الأطفال بحركات رياضية حرة.",1],
            ["استخدمت أجهزة وأدوات رياضية مناسبة.",1],
            ["استخدمت موسيقى مناسبة وسريعة.",1],
            ["أدخلت البهجة والسرور في نفوس الأطفال.",1],
            ["حرصت على توجيه الأطفال لإعادة الأدوات.",1],
            ["عرفت الأطفال على المهارة بأساليب متنوعة.",1],
            ["استخرجت نموذج أمام الأطفال لتوضيح المهارة.",1],
            ["نوعت المعلمة في تدريبات الحركة عند تنفيذ المهارة.",1],
            ["اتاحت لكل طفل التدريب على المهارة مع تصحيح الخطأ.",1],
            ["استخدمت أدوات مناسبة للمهارة.",1],
            ["استخدمت نداءات سليمة وبصوت مسموع وواضح.",1],
            ["وزعت الأطفال على مجاميع.",1],
            ["نوعت بالألعاب المستخدمة بحيث تخدم الهدف التعليمي.",1],
            ["عرضت نموذج من الأطفال لكل مجموعة.",1],
            ["قامت بتطبيق نشاط مناسب لمستوى الأطفال.",1],
            ["اهتمت بتبادل المجاميع بطريقة صحيحة ومنظمة.",1],
            ["حرصت على توجيه الأطفال لإعادة الأدوات.",1],
            ["مدى مناسبة أسلوب عرض النشاط الختامي.",1],
            ["وضحت التعليمات والمطلوب من النشاط الختامي.",1],
            ["حرصت على المشاركة والاندماج لجميع الأطفال.",1],
            ["استخدمت أساليب التشجيع المناسبة.",1],
            ["استخدمت تمارين مناسبة للاسترخاء.",1],
            ["استخدمت الموسيقى الهادئة والمناسبة.",1],
            ["حرصت على التقيد بالفترة الزمنية لكل جزء من النشاط.",1],
        ];
        foreach ($items as $key => $value) {
            Competence::create([
                'name' => $value[0],
                'is_graded' => $value[1],
            ]);
        }
    }
}
